In [42]:
import numpy as np
import pandas as pd

In [57]:
df = pd.read_excel('data/samples/sample_data_form_le1.xlsx')

In [59]:
df.head()

,Tahun Taksiran,A1,A2,A3,A4,A5,A6,A7 (Commencement Date / Incorporation Date),A8,A9,...,C3-M,C3-N,C4-B,C4-C,C4-D,C4-E,C4-F,C4-G,C4-H,C4-J
0,2025,GAS ASIA TERMINAL (L) PTE. LTD.,"UNIT LEVEL 13(A), MAIN OFFICE TOWER FINANCIAL ...",LE 23924540070,26018898000,LL08180,9171138601,07/04/2011,2,NaN,...,0,0,MISC GAS TANKERS TWO (L) PTE. LTD,"UNIT LEVEL 13(A), MAIN OFFICE TOWER FINANCIAL ...",LL18929,NaN,MY,LE 58582654040,100,0
1,2025,GUMUSUT-KAKAP SEMI-FLOATING PRODUCTION SYSTEM ...,"UNIT LEVEL 13(A), MAIN OFFICE TOWER FINANCIAL ...",LE 23909057080,26018251060,LL06165,9159287807,2007-10-10 00:00:00,2,NaN,...,0,0,MISC OBU ONE (L) PTE. LTD,"UNIT LEVEL 13(A), MAIN OFFICE TOWER FINANCIAL ...",LL18930,NaN,MY,LE58582664010,100,0

In [60]:
df['year_1'] = df['Tahun Taksiran'].astype(str)[0][0]
df['year_2'] = df['Tahun Taksiran'].astype(str)[0][1]
df['year_3'] = df['Tahun Taksiran'].astype(str)[0][2]
df['year_4'] = df['Tahun Taksiran'].astype(str)[0][3]

In [65]:
# Convert to datetime
df['A7_datetime'] = pd.to_datetime(df['A7 (Commencement Date / Incorporation Date)'], format='mixed')

In [79]:
# Extract day, month, year
df['A7_day'] = df['A7_datetime'].dt.day.apply(lambda x: ' '.join(list(str(x).zfill(2))))
df['A7_month'] = df['A7_datetime'].dt.month.apply(lambda x: ' '.join(list(str(x).zfill(2))))
df['A7_year'] = df['A7_datetime'].dt.year.apply(lambda x: ' '.join(list(str(x).zfill(2))))

In [80]:
df.head()

,Tahun Taksiran,A1,A2,A3,A4,A5,A6,A7 (Commencement Date / Incorporation Date),A8,A9,...,year_3,year_4,A7_datetime,A7_day,A7_month,A7_year,A10_from,A10_to,A11_from,A11_to
0,2025,GAS ASIA TERMINAL (L) PTE. LTD.,"UNIT LEVEL 13(A), MAIN OFFICE TOWER FINANCIAL ...",LE 23924540070,26018898000,LL08180,9171138601,07/04/2011,2,NaN,...,2,5,2011-07-04,0 4,0 7,2 0 1 1,01-01-2025,31-12-2025,01-01-2025,31-12-2025
1,2025,GUMUSUT-KAKAP SEMI-FLOATING PRODUCTION SYSTEM ...,"UNIT LEVEL 13(A), MAIN OFFICE TOWER FINANCIAL ...",LE 23909057080,26018251060,LL06165,9159287807,2007-10-10 00:00:00,2,NaN,...,2,5,2007-10-10,1 0,1 0,2 0 0 7,01-01-2025,31-12-2025,01-01-2025,31-12-2025

In [74]:
# Split A10 into A10_1 and A10_2
df[['A10_from', 'A10_to']] = df['A10'].str.split(' hingga ', n=1, expand=True)
df[['A11_from', 'A11_to']] = df['A11'].str.split(' hingga ', n=1, expand=True)

In [76]:
df.head()

,Tahun Taksiran,A1,A2,A3,A4,A5,A6,A7 (Commencement Date / Incorporation Date),A8,A9,...,year_3,year_4,A7_datetime,A7_day,A7_month,A7_year,A10_from,A10_to,A11_from,A11_to
0,2025,GAS ASIA TERMINAL (L) PTE. LTD.,"UNIT LEVEL 13(A), MAIN OFFICE TOWER FINANCIAL ...",LE 23924540070,26018898000,LL08180,9171138601,07/04/2011,2,NaN,...,2,5,2011-07-04,4,7,2011,01-01-2025,31-12-2025,01-01-2025,31-12-2025
1,2025,GUMUSUT-KAKAP SEMI-FLOATING PRODUCTION SYSTEM ...,"UNIT LEVEL 13(A), MAIN OFFICE TOWER FINANCIAL ...",LE 23909057080,26018251060,LL06165,9159287807,2007-10-10 00:00:00,2,NaN,...,2,5,2007-10-10,10,10,2007,01-01-2025,31-12-2025,01-01-2025,31-12-2025